[
  {
    "input": "Summary: Aspiring Software Engineer with 1.5 years of software development experience, skilled in building scalable solutions and optimizing performance. Passionate about problem-solving, agile methodologies, scalability and system design. Seeking to leverage software development expertise to deliver impactful solutions."
  },
  {
    "input": "Skills:\nLanguages and Frameworks: Python, Core Java, Java Servlets, Langchain, Flask, SQL, NoSQL, Spring Boot, Hibernate, JDBC, Maven, Apache Tomcat, REST, HTML, CSS, Tailwind CSS, ReactJS, TypeScript, ExpressJS, NodeJS, Data Structures and Algorithms\nTools: Eclipse, VS Code, MySQL, PostgreSQL, MongoDB, Docker, Git, Jenkins, Junit, Jira, Prometheus, Grafana, OpenAI API, Twilio API, Microsoft Word, Excel, Access, Outlook"
  },
  {
    "input": "Software Developer at Capgemini in Bengaluru, India (January 2023 - June 2023): Developed a full-stack fitness and gym platform using the MERN stack with Twilio OTP authentication. Implemented real-time gym booking system and workout recommendation engine. Built and optimized RESTful APIs and improved UI/UX using React.js and Tailwind CSS. Followed Agile methodologies, code reviews, and team collaboration. Project assessed by Capgemini professionals as part of final year project."
  },
  {
    "input": "Research Intern at La Trobe University in Melbourne, Australia - Remote (July 2021 - June 2022): Built a Dashboard with Prometheus and Grafana using Python. Worked on blockchain and IoT consensus mechanism with 95% uptime and 20% efficiency boost."
  },
  {
    "input": "Project: SmartNest (August 2024 - December 2024): Built a Smart Home management app with ReactJS frontend and Java Servlets backend. Implemented AI agents using LangChain and GPT-4o-mini. Used MySQL, MongoDB, Docker, Elasticsearch, and RAG-based search for backend. Designed multi-role auth system and integrated Message Queues."
  },
  {
    "input": "Project: Cuisine Connect (September 2024 - December 2024): Built AI chatbot for food ordering with ReactJS frontend and Flask backend. Integrated OpenAI and LangChain agents for refund handling and fraud detection."
  },
  {
    "input": "Education at Illinois Institute of Technology in Chicago, IL (August 2023 - May 2025): Master's in Computer Science"
  },
  {
    "input": "Education at Presidency University in Bengaluru, Karnataka, India (August 2019 - June 2023): Bachelor of Engineering in Computer Science"
  }
]