[
  {
    "input": "Summary: Aspiring Software Engineer with 1.5 years of software development experience, skilled in building scalable solutions and optimizing performance. Passionate about problem-solving, agile methodologies, scalability and system design. Seeking to leverage software development expertise to deliver impactful solutions."
  },
  {
    "input": "Skills:\nLanguages and Frameworks: Python, Core Java, Java Servlets, Javascript, Langchain, Flask, SQL, NoSQL, Spring Boot, Hibernate, JDBC, Maven, Apache Tomcat, REST, HTML5, CSS3, Tailwind CSS, Bootstrap, Material UI, ReactJS, Wireframing, Prototyping, User Research, TypeScript, ExpressJS, NodeJS, Elastic Search, Data Structures and Algorithms\nTools: Eclipse, VS Code, IntelliJ, MySQL, PostgreSQL, MongoDB, Docker, Git, Figma, HotJar, Spline, Photoshop, AdobeXD, Sketch, After Effects, Jenkins, Junit, Jira, Selenium, Prometheus, Grafana, OpenAI API, Twilio API, FastAPI, CoinGecko API, Tenor API, PowerBI, Tableau, Numpy, Pandas, Tensorflow, PyTorch, NTLK, Keras, Seaborn, Matplotlib, scikit-learn, Microsoft Office Suite, CI/CD Pipelines, Render"
  },
  {
    "input": "Software Developer at Capgemini in Bengaluru, India (January 2023 - June 2023): Built full-stack fitness and gym platform using MERN stack with OTP-based authentication using Twilio. Created real-time booking system with MongoDB Atlas and interactive recommendation engine. Designed and optimized REST APIs, enhanced UI/UX using React.js and Tailwind CSS. Followed Agile practices and collaborated with developers and designers. Capgemini-assessed final year project with formal evaluation."
  },
  {
    "input": "Research Intern at La Trobe University in Melbourne, Australia (Remote) (July 2021 - June 2022): Built dashboard using Prometheus and Grafana with Python. Worked on blockchain and IoT efficiency with 95% uptime and 20% boost."
  },
  {
    "input": "Project: SmartNest (August 2024 - December 2024): Built smart home product management app using Java Servlets for backend and ReactJS frontend. Integrated AI recommendations with LangChain + GPT-4o-mini. Used MySQL, MongoDB, Docker, Elasticsearch, RAG-based search and semantic embeddings. Role-based authentication and message queue integration."
  },
  {
    "input": "Project: Cuisine Connect (September 2024 - December 2024): Built AI chatbot to streamline food ordering and provide recommendations. Used OpenAI + LangChain agents for refund, defect, and fraud handling."
  },
  {
    "input": "Education at Illinois Institute of Technology in Chicago, IL (August 2023 - May 2025): Master's in Computer Science"
  },
  {
    "input": "Education at Presidency University in Bengaluru, India (August 2019 - June 2023): Bachelor of Engineering in Computer Science"
  }
]